// 정렬 되어진 배열이 있다.
// 배열과, 특정숫자가 주어질 때, 특정 숫자가 배열안에 몇 번째 요소에 있는지 인덱스를 반환하는 함수를 만들어라.

// > [1, 2, 3, 4, 6, 9], 6
// < 5
// > [3, 5, 7, 9, 11, 30], 12
// < -1

function getIndex(arr, num) {
    let idx = null;

    for (let i = 0; i < arr.length; i++) {
        if (arr[i] === num) {
            idx = i;
        }
    }
    return !idx ? -1 : idx;
}//--------------------------------------------------------------------------------------------------> 시간복잡도 O(n**2)

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                            R E F A C T O R I N G                                                  //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 이분법:)
function divideAndConquar(arr, num) {
    let left = 0;
    let right = arr.length - 1;

    while (left <= right) {
        let mid = Math.floor((left + right) / 2);

        if (arr[mid] === num) return mid;
        else if (arr[mid] > num) {
            right = mid - 1;
        } else {
            left = mid + 1;
        }
        return -1;
    }
}//------------------------------------------------------------------------------------------------->  시간복잡도 O(logn)
