// 정렬되어진 배열이 존재한다.
// 중복 값을 제외하고 유니크한 숫자의 갯수를 반환하는 함수를 작성하여라.

// > [1, 1, 2, 2, 3, 4, 5, 8, 9, 9]
// < 7

function uniqueValue(arr) {
    if (arr.length === 0) return -1;

    let cnt = 1;
    let temp = 0;

    for (let i = 0; i < arr.length; i++) {
        temp = arr[i];
        if (temp !== arr[i]) {
            cnt++;
            temp = arr[i]
        }
    }
    return cnt;
}//-----------------------------------------------------------------------------------------------------> 시간복잡도 O(n)

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                            R E F A C T O R I N G                                                  //
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 풀이방법은 크게 다르지 않지만, 2가지만의 포인터를 사용하여 풀어한다.
// 새로운 tmp공간을 생성할 필요없이 사용하지 않는 공간을 재사용했다. 대박!!
function countUniqueValue(arr) {
    if (arr.length === 0) return -1;

    let i = 0;

    for (let j = 1; j < arr.length; i++) {
        if (arr[i] !== arr[j]) {
            i++;
            arr[i] = arr[j];
        }
    }
    return i + 1;
}//---------------------------------------------------------------------------------------------------->  시간복잡도 O(n)
